In [1]:
#Dependencies 
import pandas as pd

#Importing csv files 
Dog_names = "Resources/dogNames2.csv"
Dog_licenses = "Resources/NYC_dogs_clean.csv"

In [2]:
#Reading the csv files 
Dognames_df = pd.read_csv(Dog_names)
Doglicenses_df = pd.read_csv(Dog_licenses)

#First df, showing only two columns, renaming to match second df (future merge)
Dognames_dfsorted = Dognames_df[['Row_Labels','Count_AnimalName']]
Dognames_dfrename = Dognames_dfsorted.rename(columns={'Row_Labels':'Name','Count_AnimalName':'Name_Count'})
Dognames_dfrename.head()

    Name  Name_Count
0      1           1
1      2           2
2  40804           1
3  90201           1
4  90203           1

In [3]:
Dognames_dfrename.count()

Name          16217
Name_Count    16220
dtype: int64

In [4]:
#Sort by count column to find the most popular dog names 
Dognames_dfrename.sort_values(['Name_Count'], ascending=False).head()

          Name  Name_Count
1156     BELLA        1195
9140       MAX        1153
2660   CHARLIE         856
3251      COCO         852
12368    ROCKY         823

In [5]:
#Create second df, showing only four columns, renaming to match first df 
Doglicenses_dfsorted = Doglicenses_df[['X','AnimalName', 'BreedName','Borough']]
Doglicenses_dfrenamed = Doglicenses_dfsorted.rename(columns={'AnimalName':'Name'})
Doglicenses_dfrenamed.head()

   X     Name BreedName   Borough
0  1  SHADOW     Beagle  Brooklyn
1  2    ROCCO     Boxer  Brooklyn
2  3    LUIGI   Maltese     Bronx
3  4  PETUNIA       Pug  Brooklyn
4  5    ROMEO   Maltese     Bronx

In [6]:
#Here we took several steps to clean up the rows. We are deleting any that state the Breed Name or Name of dog as 
#unknown, not provided or blanks.
Doglicenses_dfrenamed = Doglicenses_dfrenamed[Doglicenses_dfrenamed['BreedName'] != 'Unknown']
Doglicenses_dfrenamed = Doglicenses_dfrenamed[Doglicenses_dfrenamed['Name'] != 'Unknown']
Doglicenses_dfrenamed = Doglicenses_dfrenamed[Doglicenses_dfrenamed['Name'] != 'UNKNOWN']
Doglicenses_dfrenamed = Doglicenses_dfrenamed[Doglicenses_dfrenamed['Name'] != 'NAME NOT PROVIDED']
Doglicenses_dfrenamed = Doglicenses_dfrenamed[Doglicenses_dfrenamed['Name'] != ' ']
Doglicenses_dfrenamed.head()

   X     Name BreedName   Borough
0  1  SHADOW     Beagle  Brooklyn
1  2    ROCCO     Boxer  Brooklyn
2  3    LUIGI   Maltese     Bronx
3  4  PETUNIA       Pug  Brooklyn
4  5    ROMEO   Maltese     Bronx

In [7]:
#Find count for how many dogs are listed as each breed. Find the top 10 most popular breeds in NYC. 
breed_counts = pd.DataFrame(Doglicenses_dfrenamed['BreedName'].value_counts())
breed_counts.head(10)

                                      BreedName
Yorkshire Terrier                          7359
Shih Tzu                                   6849
Chihuahua                                  5554
Labrador Retriever                         4135
Maltese                                    4072
American Pit Bull Mix / Pit Bull Mix       3359
American Pit Bull Terrier/Pit Bull         3329
Labrador Retriever Crossbreed              2730
Pomeranian                                 2029
Beagle                                     2025

In [8]:
#How many dogs are now in the data set?
breed_counts['BreedName'].sum()

101210

In [9]:
#Create a dataframe to look at the most popular names per breed. Show top 10. 
breeds_names = pd.DataFrame(Doglicenses_dfrenamed.groupby('BreedName')["Name"].value_counts())
breeds_names_df = breeds_names.rename(columns={'Name':'Count of Names per Breed'})
breeds_names_count = breeds_names_df.sort_values(['Count of Names per Breed'], ascending=False)
breeds_names_count['Breed_Rank'] = breeds_names_count.groupby('BreedName').rank(ascending=False)
breeds_names_count = breeds_names_count.reset_index()
breeds_name_ranks = breeds_names_count.loc[(breeds_names_count['Breed_Rank'] == 1.0)]

breeds_name_ranks.head(10)

,BreedName,Name,Count of Names per Breed,Breed_Rank
0,Shih Tzu,OREO,92,1.0
1,Yorkshire Terrier,BELLA,89,1.0
13,Chihuahua,BELLA,49,1.0
16,American Pit Bull Terrier/Pit Bull,BLUE,47,1.0
21,Cavalier King Charles Spaniel,CHARLIE,45,1.0
27,American Pit Bull Mix / Pit Bull Mix,BELLA,41,1.0
31,Maltese,BELLA,40,1.0
40,German Shepherd Dog,MAX,34,1.0
41,Labrador Retriever,BAILEY,34,1.0
61,Boxer,ROCKY,28,1.0

In [10]:
# Merge the two datasets together by 'Name'. 
dog_df = pd.merge(Dognames_dfrename,Doglicenses_dfrenamed, on='Name')
total_dog_df = dog_df[['Name','Name_Count', 'BreedName','Borough']]
total_dog_df.head()

    Name  Name_Count             BreedName    Borough
0      1           1               Maltese   Brooklyn
1  MARCH           2   Australian Shepherd  Manhattan
2  MARCH           2   Australian Shepherd  Manhattan
3  MARCH           2             Pekingese  Manhattan
4  MARCH           2  Chihuahua Crossbreed      Bronx

In [11]:
#Find how many dogs are licensed in each burough
burough_count = pd.DataFrame(total_dog_df["Borough"].value_counts())
burough_count

               Borough
Manhattan        27550
Brooklyn         18874
Queens           15433
Bronx             7625
Staten Island     6748

### Scrape for dog images

In [12]:
from splinter import Browser

In [13]:
# Launch splinter browser
executable_path = {'executable_path': '/usr/local/bin/chromedriver'}
browser = Browser('chrome', **executable_path, headless=False)

In [14]:
# URL of page to be scraped
url = 'https://dogtime.com/dog-breeds/profiles'
browser.visit(url)

In [15]:
# Store web's list of dogs and img urls into DataFrame
web_breed_img_df = pd.DataFrame(columns=['BreedName', 'Img_URL'])

# Find all images in webpage
web_breed_imgs = browser.find_by_tag('img')

# loop through images and store breed + img_url into a DataFrame: 216 breeds
for web_breed_img in web_breed_imgs: 
    breed = web_breed_img['alt']
    img_url = web_breed_img['src']
    if breed:
        web_breed_img_df =web_breed_img_df.append({'BreedName': breed, 'Img_URL': img_url}, ignore_index=True)

In [16]:
# Get total BreedNames from DogLicenses: 299 unique types
len(Doglicenses_dfrenamed["BreedName"].unique())

298

In [17]:
# Get the list of Dong licenses BreedName not in the web's list of dog images: len=114
breed_img_missing_list = Doglicenses_dfrenamed[~Doglicenses_dfrenamed["BreedName"]\
                                               .isin(web_breed_img_df["BreedName"])].BreedName.unique()
# Peek 5 samples
breed_img_missing_list[:5]

array(['Morkie', 'Akita Crossbreed', 'Labrador Retriever Crossbreed',
       'American Pit Bull Mix / Pit Bull Mix',
       'American Pit Bull Terrier/Pit Bull'], dtype=object)

In [18]:
# Will need to determine how we want to transform the missing BreedName values to suit our DB

In [19]:
# SQL Alchemy
from sqlalchemy import create_engine
# PyMySQL 
import pymysql
pymysql.install_as_MySQLdb()

from config import mysql_pwd

In [20]:
# # Run this to Create Dog_Time Database
# # connect to server
# engine = create_engine(f"mysql://root:{mysql_pwd}@localhost:3306/")
# # create db
# engine.execute("CREATE DATABASE Dog_Time")
# # select new db
# engine.execute("USE Dog_Time") 
# # Create connection to engine
# conn = engine.connect()

In [21]:
# Run this if Database exists
engine = create_engine(f"mysql://root:{mysql_pwd}@localhost:3306/Dog_Time")
# Create connection to engine
conn = engine.connect()

In [22]:
# web_breed_img_df.to_sql('web_breed_img', con=conn)